#Задача 1: Четные числа
#Напишите программу, которая с помощью цикла
#  while выводит все не чётные от 1 до 20.

count = 1
while count <= 20:
    if count % 2 ==1:
        print(count)
    count+=1
        
   