#Задача 2: Сумма чисел до 100
#Напишите программу, которая суммирует все
#  числа от 1 до 100 и выводит результат с помощью цикла while.
count = 1
sum = 0
while count <=100:
    sum +=count
    count+=1
print(sum)













