name = input("Как ваше имя? ")
nameLast = input("Как ваше фамилия? ")
nameLastLast = input("Как ваше Отчество? ")
print("Приветствую",name,nameLast,nameLastLast)
# Написать форму ,которая спрашивает 
# ваше имя,фамилию,отчество
# и выводило сообщение "Приветствую ФИО"
# ВВОД:
# Вова
# Воронов
# Дмитриевич
# ВЫВОД : "Приветствую Воронов Вова Дмитриевич"