#Задача 7: Удаление пробелов
# replace
# Ввод
# 8-999-999-99-99
# Вывод
# 89999999999
number = input("Введите номер: ")
replaceNumber = number.replace("-","")
print(replaceNumber)
