#Задача 1: Приветствие
#Напишите программу, 
# которая спрашивает у пользователя 
# его имя и выводит приветствие.
name = input("Введите ваше имя: ")
lastName = input("Введите вашу фамилию: ")
print("Приветствую,",name,lastName)