# # Задача 2: Обратная строка
# #Напишите программу, 
# # которая принимает строку
# #  и выводит её в обратном 
# # порядке.
string = input("Введите вашу строку: ")
newString = string[::-1]
print(newString)
